{ /*Задача №1: Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.*/

Console.WriteLine("Введите число ");
string number = Console.ReadLine();
if (number.Length > 2) Console.WriteLine(number[2]);
else Console.WriteLine("Длина массива менее трёх элементов");

/*int number = 123456789; // математический способ решения задачи
int digital = 0;
while (number/100 > 0) 
{
    digital = number % 10;
    number/=10;
}
Console.WriteLine(digital);*/   
}

{ /*Задача №2: Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.*/





}



